title: Data Staging via 7-Zip (Password Protected Archive)
id: 2bd0b1f1-349b-4bca-8ddd-6966fc656045
status: stable
description: Detects use of 7-Zip to archive and password protect files for data exfiltration
author: Tam-George Belema
date: 2025-09-20
modified: 2025-09-20

logsource:
  product: windows
  service: sysmon

detection:
  selection_event:
    EventID: 1

  selection_image:
    Image|endswith:
      - '\7z.exe'

  selection_command:
    CommandLine|contains|all:
      - ' a '
      - '.zip'
      - '-p'

  condition: selection_event and selection_image and selection_command

fields:
  - EventID
  - Image
  - CommandLine
  - Hashes
  - ParentImage
  - ParentCommandLine
  - User
  - CurrentDirectory

falsepositives:
  - IT administrators creating password-protected backups

level: high

tags:
  - attack.collection
  - attack.t1560.001   # Archive via 7-Zip
  - attack.t1074      # Data Staging
